app/controllers/listings_controller.rb

INSERT INTO "listings" ("name", "description", "price", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "apple"], ["description", "this is apple"], ["price", 100.0], ["created_at", "2017-05-07 20:04:15.573942"], ["updated_at", "2017-05-07 20:04:15.573942"]]
---
  def create
    @listing = Listing.new(listing_params)

    respond_to do |format|
      if @listing.save

UPDATE "listings" SET "price" = ?, "image" = ?, "updated_at" = ? WHERE "listings"."id" = ?  [["price", 125.0], ["image", "2fd3e95b45cbde92e61184f589782279-d3b2xkn1.jpg"], ["updated_at", "2017-05-08 14:21:01.673498"], ["id", 5]]
---
  def update
    respond_to do |format|
      if @listing.update(listing_params)